Revit 2027 API
XYZ.X Property
Gets the first coordinate.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double X { get; }
Public ReadOnly Property X As Double
	Get
public:
property double X {
	double get ();
}
member X : float with get
Property Value
Double
See Also
Reference
XYZ Class
Autodesk.Revit.DB Namespace